def ask_question(field):

    QUESTIONS = {

        "age": "మీ వయస్సు ఎంత?",

        "income_level": "మీ కుటుంబ ఆదాయం తక్కువ వర్గంలోకి వస్తుందా? (అవును / కాదు)",

        "religion": "మీ మతం ఏమిటి? (హిందూ / ముస్లిం / క్రైస్తవ)",

        "widow": "మీ భర్త మరణించారా? (అవును / కాదు)",

        "single_woman": "మీరు విడాకులు పొందారా లేదా ఒంటరిగా ఉంటున్నారా? (అవును / కాదు)",

        "pregnant": "మీరు గర్భవతిగా ఉన్నారా? (అవును / కాదు)",

        "delivery_in_govt_hospital": "ప్రభుత్వ ఆసుపత్రిలో డెలివరీ చేయాలనుకుంటున్నారా? (అవును / కాదు)",

        "serious_illness": "మీకు పెద్ద ఆపరేషన్ లేదా తీవ్రమైన వ్యాధి ఉందా? (అవును / కాదు)",

        "skill_in_tailoring": "మీకు కుట్టు పని (టైలరింగ్) వచ్చా? (అవును / కాదు)",

        "minority_woman": "మీరు మైనారిటీ వర్గానికి చెందారా? (అవును / కాదు)",

        "woman": "మీరు మహిళా కుటుంబ ప్రధానులా? (అవును / కాదు)",

        "pregnant_or_lactating": "మీరు గర్భిణి లేదా బాలింతలా ఉన్నారా? (అవును / కాదు)"
    }

    return QUESTIONS.get(field, "కొంచెం మరింత సమాచారం ఇవ్వండి")